OpenFOAM-v1812/tutorials/multiphase/interFoam/RAS/waterChannel/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom   mesh;
sourceCase      "<case>";
sourcePatches   (outlet);

flipNormals     false;

extrudeModel    linearDirection;

nLayers             40;
expansionRatio      1.0;

linearDirectionCoeffs
{
    axisPt          (0 0 0);
    direction       (1 -0.2 -0.03);
    thickness       40;
}

mergeFaces      false;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
